
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПолноеИмяМетаданных", fast8ПолноеИмяМетаданных);
	
	Если Не ЗначениеЗаполнено(fast8ПолноеИмяМетаданных) Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	Иначе
		ЗаполнитьРазмерыФайлов();
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ЗаполнитьРазмерыФайлов()
	
	fast8РазмерыФайлов.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Если СтрокаНачинаетсяС(fast8ПолноеИмяМетаданных, "Справочник") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТИПЗНАЧЕНИЯ(Таблица.Ссылка) КАК Объект,
		|	СУММА(ВЫБОР
		|			КОГДА Таблица.ТипХраненияФайла = ЗНАЧЕНИЕ(Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе)
		|				ТОГДА Таблица.Размер
		|			ИНАЧЕ 0
		|		КОНЕЦ) / 1048576 КАК РазмерВБазе,
		|	СУММА(ВЫБОР
		|			КОГДА Таблица.ТипХраненияФайла = ЗНАЧЕНИЕ(Перечисление.ТипыХраненияФайлов.ВТомахНаДиске)
		|				ТОГДА Таблица.Размер
		|			ИНАЧЕ 0
		|		КОНЕЦ) / 1048576 КАК РазмерВТомах,
		|	СУММА(ВЫБОР
		|			КОГДА Таблица.ТипХраненияФайла = ЗНАЧЕНИЕ(Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоВБазе,
		|	СУММА(ВЫБОР
		|			КОГДА Таблица.ТипХраненияФайла = ЗНАЧЕНИЕ(Перечисление.ТипыХраненияФайлов.ВТомахНаДиске)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоВТомах
		|ИЗ
		|	" + fast8ПолноеИмяМетаданных + " КАК Таблица
		|
		|СГРУППИРОВАТЬ ПО
		|	ТИПЗНАЧЕНИЯ(Таблица.Ссылка)";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТИПЗНАЧЕНИЯ(ДвоичныеДанныеФайлов.Файл) КАК Объект,
		|	СУММА(ДвоичныеДанныеФайлов.Файл.Размер) / 1048576 КАК РазмерВБазе,
		|	СУММА(1) КАК КоличествоВБазе,
		|	""Не анализируется"" КАК КоличествоВТомах,
		|	""Не анализируется"" КАК РазмерВТомах
		|ИЗ
		|	РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
		|
		|СГРУППИРОВАТЬ ПО
		|	ТИПЗНАЧЕНИЯ(ДвоичныеДанныеФайлов.Файл)";
	КонецЕсли;	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МакетРазмерФайлов = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетРазмерФайловБСП");
	ОбластьШапка	= МакетРазмерФайлов.ПолучитьОбласть("Шапка");
		
	fast8РазмерыФайлов.СохранятьСвойстваОтображения = Истина;
	fast8РазмерыФайлов.Вывести(ОбластьШапка);
		
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока	= МакетРазмерФайлов.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Выборка.Объект);
		ОбластьСтрока.Параметры.Объект = ?(ОбъектМетаданных = Неопределено, "", ОбъектМетаданных.ПолноеИмя());
		
		fast8РазмерыФайлов.Вывести(ОбластьСтрока);
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьРазмерыФайлов()

Функция СтрокаНачинаетсяС(ИсходнаяСтрока, Вхождение)
	
	// СтрНачинаетсяС
	
	Возврат (Лев(ИсходнаяСтрока, СтрДлина(Вхождение)) = Вхождение);
	
КонецФункции // СтрокаНачинаетсяС()
