
Функция СведенияОВнешнейОбработке() Экспорт
	
	// Если запуск осуществляется при отсутствии БСП
	МодульДополнительныеОтчетыИОбработки = Вычислить("ДополнительныеОтчетыИОбработки");
	МодульДополнительныеОтчетыИОбработкиКлиентСервер = Вычислить("ДополнительныеОтчетыИОбработкиКлиентСервер");
	
    ПараметрыРегистрации = МодульДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    ПараметрыРегистрации.Вид				= МодульДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.Версия				= "2020.09.13";
    ПараметрыРегистрации.БезопасныйРежим	= Ложь;
    ПараметрыРегистрации.Информация			= "Base's tables analitics (FAST8) by Sa1m0nn 2020";
    
    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление			= "Base's tables analitics (FAST8)";
    Команда.Идентификатор			= "FAST8BasesTablesAnalitics";
    Команда.Использование			= МодульДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    Команда.ПоказыватьОповещение	= Истина;
    Команда.Модификатор				= "FAST8BasesTablesAnalitics";
    
    Возврат ПараметрыРегистрации;
    
КонецФункции // СведенияОВнешнейОбработке()