
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПолноеИмяМетаданных", fast8ПолноеИмяМетаданных);
	
	Если Не ЗначениеЗаполнено(fast8ПолноеИмяМетаданных) Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	Иначе
		ЗаполнитьХранение();
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ЗаполнитьХранение()
	
	fast8Хранение.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	МетаданныеСсылки = Метаданные.НайтиПоПолномуИмени(fast8ПолноеИмяМетаданных);
	ОбъектыМетаданных = Новый Массив;
	ОбъектыМетаданных.Добавить(МетаданныеСсылки);	
	
	ТаблицаСУБД = ПолучитьСтруктуруХраненияБазыДанных(ОбъектыМетаданных);
	
	МакетХранение = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетХранение");
	ОбластьОсновнаяГруппировка		= МакетХранение.ПолучитьОбласть("ОсновнаяГруппировка");
	ОбластьПоляГруппировка			= МакетХранение.ПолучитьОбласть("ПоляГруппировка");
	ОбластьИндексыЗаголовок			= МакетХранение.ПолучитьОбласть("ИндексыЗаголовок");
	ОбластьИндексыПоляГруппировка	= МакетХранение.ПолучитьОбласть("ИндексыПоляГруппировка");
			
	fast8Хранение.СохранятьСвойстваОтображения = Истина;
	fast8Хранение.НачатьАвтогруппировкуСтрок();
	Для Каждого СтрокаТЧ Из ТаблицаСУБД Цикл
		fast8Хранение.Вывести(ОбластьОсновнаяГруппировка, 0);
		ОбластьСтрока = МакетХранение.ПолучитьОбласть("ОсновнаяСтрока");
		ОбластьСтрока.Параметры.Заполнить(СтрокаТЧ);
		fast8Хранение.Вывести(ОбластьСтрока);
		
		fast8Хранение.Вывести(ОбластьПоляГруппировка, 1);
		Для Каждого СтрокаПоле Из СтрокаТЧ.Поля Цикл			
			ОбластьСтрока = МакетХранение.ПолучитьОбласть("ПоляСтрока");
			ОбластьСтрока.Параметры.Заполнить(СтрокаПоле);
			fast8Хранение.Вывести(ОбластьСтрока, 1);
		КонецЦикла;
		
		fast8Хранение.Вывести(ОбластьИндексыЗаголовок, 1);
		Для Каждого СтрокаИндекс Из СтрокаТЧ.Индексы Цикл			
			ОбластьИндексыГруппировка = МакетХранение.ПолучитьОбласть("ИндексыГруппировка");
			ОбластьИндексыГруппировка.Параметры.Заполнить(СтрокаИндекс);
			fast8Хранение.Вывести(ОбластьИндексыГруппировка, 1);
			
			fast8Хранение.Вывести(ОбластьИндексыПоляГруппировка, 2);
			Для Каждого СтрокаИндексПоле Из СтрокаИндекс.Поля Цикл
				ОбластьСтрока = МакетХранение.ПолучитьОбласть("ИндексыПоляСтрока");
				ОбластьСтрока.Параметры.Заполнить(СтрокаИндексПоле);
				fast8Хранение.Вывести(ОбластьСтрока, 2);
			КонецЦикла;
		КонецЦикла;		
	КонецЦикла;
	fast8Хранение.Вывести(МакетХранение.ПолучитьОбласть("ПустаяСтрока"), 0);
	fast8Хранение.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры // ЗаполнитьХранение()
